# 2024-12-23

In [ ]:
for a in range(2,10):
    for i in range(1,10):
        print(a * i, end=' ')
    print()

In [ ]:
coffee = 3


while coffee !=0 :
    money = input('금액을 입력하세요: ')
    if coffee == 0:
        print('커피가 다 떨어졌습니다 자판기를 종료합니다')     # 이 문구가 나오게 다시해볼것것
        break
    elif int(money) >=300 :
        coffee -= 1
        print('커피 한 잔이 나옵니다.')
        print(f'거르름돈은{int(money)-300}입니다.')
        print(f'남은 커피의 갯수: {coffee}')
    elif int(money) <300 :
        print(f'금액이 부족합니다{int(money)}원을 반환합니다.')
        print(f'남은 커피의 갯수: {coffee}')

In [ ]:
Menu_1 = {'김밥':3000, '라면':4500, '순대':2500, '떡볶이':5000}
print(Menu_1.values())
print(Menu_1.keys())
print(Menu_1.items())
Menu_1.get('김밥')

In [ ]:
todolist_1 = []
input_num = 0
prompt_1 = '''1:추가
2:삭제
3:종료'''

while input_num !=3 :
    print('*'*20)
    print(prompt_1)
    input_num = int(input('숫자를 입력하세요: '))
    if input_num ==1:
        todolist_1.append(input('할일 내용 입력: '))
    elif input_num ==2:
        todolist_1.remove(input('삭제 할 리스트: '))
    elif input_num ==3:
        print('프로그램을 종료합니다.')
        break
    else :
        print('잘못된 입력입니다. 다시 선택해주세요')

    for i in range(len(todolist_1)):
        print('*'*20)
        print(f'{i+1}.{todolist_1[i]}')

In [ ]:
callbook_1 = []
prompt_1 = '''1.추가
2.검색
0.종료'''
input_num = 0
while True :
    print(prompt_1)
    input_num = int(input('숫자를 입력하세요: '))
    if input_num ==1:
        callbook_1 = {input('추가할 이름을 입력하세요: '):input('추가할 전화번호를 입력하세요: ')}
    elif input_num ==2:
        print('검색가능한 이름들:', list(callbook_1.keys()))
        fide_name = input('검색할 이름을 입력하세요: ')
        fide_callnum = callbook_1.get(fide_name)
        print(f'검색한 {fide_name}의 전화번호는{fide_callnum}입니다.')
    elif input_num ==0:
        print('프로그램을 종료합니다.')
        break
    else:
        print('잘못된 입력입니다. 다시 선택해주세요')

In [ ]:
addr = {
    '박지민': '010-1111-1111', 
    '전정국': '010-2222-2222', 
    '정호석': '010-3333-3333', 
    '김석진': '010-4444-4444', 
    '김남준': '010-6666-6666', 
}

while True:
    print('메뉴선택(1. 추가, 2. 검색, 0. 종료)? :', end=" ")
    menu = int(input('메뉴선택(1. 추가, 2. 검색, 0. 종료)? :'))
    print(menu)

    if menu == 1: # 추가
        addr_key = input('친구 이름 입력>> ')
        addr_value = input('전화번호 입력>> ')
        addr[addr_key] = addr_value # 새로운 요소 삽입
    elif menu == 2: # 검색
        # 어떤친구이름이 있는지보여주기
        print('내 친구들', list(addr.keys()))
        name = input('검색할 친구 이름 입력>> ')
        # print(addr[name]) --> 이렇게하면 밸류값만 나오게됨
        if addr.get(name):          # 잘못된 이름넣으면
            print('그런 이름 없음')
        else:
            print(addr.get(name))     
    elif menu == 0:
        print('프로그램을 종료합니다.')
        break
    else:
        print('잘못된 번호를 입력했습니다.')
        continue

In [ ]:
fruit = ['사과', '포도', '홍시']
i = input('좋아하는 과일은?: ') 

if i in fruit:
    print('과일 바구니에 있는 과일입니다.')
else :
    print('없는 과일입니다.')

# 사용자 정의 함수

In [ ]:
def 함수이름(매개변소):
    수행할 명령어
    retrun 리턴값

In [ ]:
def Hi():
    print('hi')

Hi()

In [ ]:
def num_max(a, b, c):
    if a > b:
        if a > c:
            return a
        else:
            return c
    elif b > c:
        return b
    else :
        return c
        
        
print(num_max(111,1133,1155))

In [ ]:
def isLeapYear(year_num):
    if year_num % 4 == 0 and not year_num %100 == 0 or year_num % 400 ==0 :
        return True
    else :
        return False

print(isLeapYear(2022))
print(isLeapYear(2010))
print(isLeapYear(2000))
print(isLeapYear(1900))
print(isLeapYear(1600))

In [ ]:
def add_all(*abc):
    result = 0
    for i in abc:
        result += i
    return result

print(add_all(1,2,3,4,5,6,7,8,9,10))

In [ ]:
def add_mul(test, *test_1):

In [ ]:
def func(a,b):
    return a+b, a-b, a*b, a//b

result_1, result_2, result_3, result_4 = func(10,3)

print(result_1, result_2, result_3, result_4)
print(result_4)
print(result_1)
print(result_2)
print(result_3)

In [ ]:
movie_rank = ['닥터스트레인지', '스플릿', '럭키']
a = movie_rank.append('배트맨')
movie_rank.insert(1, '슈퍼맨')
movie_rank.pop(3)
movie_rank.pop()
movie_rank.pop()
print(movie_rank)

In [ ]:
a, b, c = input().split()       # 스플릿 띄어쓰기를 기준으로 입력하면 a,b,c 각각 변수에 문자가 대입됨
s, h, f = str(a), float(b), int(c)      # 입력된 문자를 타입에 맞게 변경하고 대입함
print(f'{type(s)}, {type(h)}, {type(f)}')
print(f'name={s} height={h} age={f}')

In [ ]:
d = {'kim':34000, 'lee':12000, 'park':1200, 'lew':0, 'song':3420}
sum(d.values())

In [ ]:
def make_list(string):
    return list(string)
make_list('asdf')

In [ ]:
a = ['dasfdgfdg']
b = list('asfsdg')
print(b)

In [ ]:
def vartest(a):
   a = a + 1
    
print(vartest(3))
print(a)

In [ ]:
mylist = [1,2,3,4,5]

def add_one(n):
    return n+1

result = list(map(add_one, mylist))
print(result)

In [ ]:
f = (3.14, -5.625, 100.4, 25.8)

result_f = list(map(round,f))
print(result_f)

In [ ]:
r = [52, 255, 39, 132]
g = [19, 63, 227, 197]
b = [0, 68, 255, 187]
a = ['wdwdfdfsdf']
print(list(zip(r,g,b)))
list(zip(*a))

In [ ]:
f = ('apple', 'orange', 'banana', 'mango')
tag = dict(enumerate(f,1))
print(tag)

In [ ]:
def f(x):
    return  10> x > 6
a = [8, 3, 2, 10, 15, 7, 1, 9, 0, 11]
list(filter(f, a))

In [ ]:
numbers = [1,2,3,4]
squared = list(map(lambda x:x**2, numbers))
print(squared)

In [ ]:
numbers = [1,2,3,4,5]
even_numbers = list(filter(lambda x : x%2==0, numbers))
print(even_numbers)

In [ ]:
points = [(1,2), (3,4), (5,1)]
sorted_points = sorted(points, key=lambda x:x[1])
print(sorted_points)

In [ ]:
sorted?     # 함수에 ? 붙이면 함수설명 알 수 있음

In [ ]:
import math
math.pow(2,3)

In [ ]:
import math as m
m.pow(2,3)

In [ ]:
import random
result_number = []
while len(result_number) < 6:
    num = random.randint(1,45)
    if num not in result_number:
        result_number.append(num)

print(result_number)

In [ ]:
import random

# 1부터 45까지의 숫자 중에서 랜덤으로 6개 선택
lotto_numbers = random.sample(range(1, 46), 6)

# 결과 출력
print("랜덤으로 뽑힌 숫자:", sorted(lotto_numbers))

In [ ]:
class FourCal:
    def __init__(self, num1, num2):
        self.num1 = num1
        self.num2 = num2
    def add(self):
        result = self.num1 + self.num2
        return result
    def sub(self):
        result = self.num1 - self.num2
        return result
    def mul(self):
        result = self.num1 * self.num2
        return result
    def div(self):
        result = self.num1 / self.num2
        return result


a = FourCal(5,9)
a.sub()

In [ ]:
score = 70
message = '합격입니다!' if score > 60 else '불합격입니다.'
print(message)

In [ ]:
# squares = []
# numbers_1 = [1,2,3,4,5,6]
# for x in numbers_1:
#     squares.append(x**2)
# print(squares)

# squares = [x**2 for x in numbers_1]
# print(squares)

numbers_2 = [1, 2, 3, 4, 5, 6, 7]
even_numbers = [ x % 2 == 0 for x in numbers_2 ]
print(even_numbers)

even_numbers_1 = []
for x in numbers_2:
    x % 2 == 0
    even_numbers_1.append(x)
print(even_numbers_1)

In [ ]:
numbers_2 = [1, 2, 3, 4, 5, 6, 7]
even_numbers = []

for x in numbers_2:
    if x % 2 == 0:
        even_numbers.append(x)
print(even_numbers)

# 2024-12-27

# 넘파이

In [ ]:
pip install numpy # 넘파이 설치

In [2]:
import numpy as np #넘파이쓰는 용어

In [ ]:
np.__version__

In [ ]:
a_list = [1,2,3,4]
a_list

In [ ]:
type(a_list)

In [ ]:
int_arr = np.array([1,2,3,4])
int_arr

In [ ]:
print(int_arr)

In [ ]:
type(int_arr)

In [ ]:
list_data = []

arr = np.array(list_data)
print(arr)
print(type(arr))

In [ ]:
arr1 = np.arange(10)

arr1

In [ ]:
arr = np.zeros(10, int)
print(arr)

In [ ]:
arr = np.array([[1,2,3,4], [5,6,7,8], [9,10,11,12]])
print(arr)
print(arr.ndim)
print(arr.shape)

In [ ]:
arr = np.array([[[1,2,3,4], [5,6,7,8]], [[9,10,11,12],[13,14,15,16]], [[17,18,19,20],[21,22,23,24]]])
print(arr)
print(arr.ndim)
print(arr.shape)

In [ ]:
int_arr = np.array([1,2,3,4])
print(int_arr)
print(int_arr.ndim)
print(int_arr.shape)

In [ ]:
arr = np.array(range(1,11))

arr.reshape(-1,5)

In [ ]:
a = np.array([1,2,3])
b = np.array([4,5,6])

a+b

In [ ]:
data = [0,1,2,3,4,5,6,7,8,9]
answer = []
for x in data :
    answer([x*2])

In [ ]:
a = np.array([[0,1,2],[3,4,5]])

print(a[0][0], a[0][1], a[1][2])

In [ ]:
a = np.array([[0,1,2,3], [4,5,6,7]])

print(a[0][:])
print(a[:,1])
print(a[1,1:])
print(a[:, :2])

In [ ]:


a = np.array([1,2,3])
b = np.array([10,20,30])

print(2*a+b)
print(a ==2)
print(b>10)
print((a==2)&(b>10))

In [ ]:
a = np.array([0,1,2,3,4,5,6,7,8,9])
idx = np.array(a > 4)
print(idx)
print(a[idx])

a[a%2==0]

In [ ]:
a = np.array([[1,2,3,4], [5,6,7,8], [9,10,11,12]])

a[::-1]

In [ ]:
x = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19,20])
print(x[x%3==0])
print(x[x%4==1])
x[(x%3==0) & (x%4==1)]

# 판다스

In [ ]:
import pandas

In [ ]:
pip install pandas  # 판다 설치치

In [2]:
import pandas as pd #판다 사용단축어어

In [ ]:
pd.__version__

In [87]:
s = pd.Series([3,-5,7,4], index=('a','b','c','d'))
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [86]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [88]:
s*3

a     9
b   -15
c    21
d    12
dtype: int64

In [6]:
df = pd.DataFrame([['부산광역시', '051', 3364358], ['전라남도','061', 1840921], ['강원도', '033', 153530]])

print(df)
print(type(df))

df = pd.DataFrame({'Division':['부산광역시', '전라남도', '강원도'],
                 'code':['051','061', '033'],
                 'Population':[253255, 257345, 153530]})

print(display(df)) # print(df) 에서 넣은거거
print(type(df))
df.index
df.columns
df.values
df.info()

print(df.iloc[0,2])

       0    1        2
0  부산광역시  051  3364358
1   전라남도  061  1840921
2    강원도  033   153530
<class 'pandas.core.frame.DataFrame'>

  Division code  Population
0    부산광역시  051      253255
1     전라남도  061      257345
2      강원도  033      153530

None
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Division    3 non-null      object
 1   code        3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
253255

In [107]:
df = pd.read_csv('heroes.csv')
print(display(df))

      이름  나이     직업     국적    키            재산
0   아이언맨  58    CEO     미국  174  1.150000e+10
1     토르  45      신  아스가르드  190           NaN
2  스파이더맨  18   고등학생     미국  177  6.000000e+02
3   원더우먼  27     공주  데미스키라  178           NaN
4     헐크  33  핵물리학자     미국  270  1.000000e+09
5   캡틴마블  25    파일럿     미국  170  3.400000e+08
6  블랙위도우  32    스파이    러시아  170  5.000000e+07

None

In [6]:
pd.options.display.float_format = '{:.0f}'.format

In [7]:
df = pd.read_csv('heroes.csv')
display(df)
df.info()
df.head()   # 앞에서 (5개:디폴트)
df.tail()   # 뒤에서 (5개:디폴트)
df.describe()   # 계산할수 있는 숫자만 가져와서 계산해줌
print(df['국적'])      # 국적만 보여줌 / 타입은 시리즈
print(df['국적'].unique())     # 국적의 종류가 몇개나되는지 전부 다 보여줌
print(df['국적'].value_counts())   # 국적의 종류의 수가 몇인지 알려줌
df['나이'].nlargest()   # 나이순으로 정렬
df.nlargest(7, '키')      # 데이터 자체를 정렬할때 (몇개 보여줄건지int, 무슨컬럼기준으로정렬할건지)

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
5   캡틴마블  25    파일럿     미국  170   340000000
6  블랙위도우  32    스파이    러시아  170    50000000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   직업      7 non-null      object
 3   국적      7 non-null      object
 4   키       7 non-null      int64
 5   재산      5 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 468.0+ bytes
0       미국
1    아스가르드
2       미국
3    데미스키라
4       미국
5       미국
6      러시아
Name: 국적, dtype: object
['미국' '아스가르드' '데미스키라' '러시아']
국적
미국       4
아스가르드    1
데미스키라    1
러시아      1
Name: count, dtype: int64

      이름  나이     직업     국적    키          재산
4     헐크  33  핵물리학자     미국  270  1000000000
1     토르  45      신  아스가르드  190         NaN
3   원더우먼  27     공주  데미스키라  178         NaN
2  스파이더맨  18   고등학생     미국  177         600
0   아이언맨  58    CEO     미국  174 11500000000
5   캡틴마블  25    파일럿     미국  170   340000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [144]:
df[['이름', '키']][0:2]

     이름    키
0  아이언맨  174
1    토르  190

In [145]:
df.iloc[0]
df.iloc[[1,5,2]]
df.iloc[0:5]
df.iloc[:2, :5]

     이름  나이   직업     국적    키
0  아이언맨  58  CEO     미국  174
1    토르  45    신  아스가르드  190

In [10]:
df2 = df.copy()
df2.index = ['a', 'b', 'c', 'd', 'f', 'g', 'h']
df2.loc['a':'b', '이름']

a    아이언맨
b      토르
Name: 이름, dtype: object

In [157]:
df[df['재산'].isnull()]

     이름  나이  직업     국적    키  재산
1    토르  45   신  아스가르드  190 NaN
3  원더우먼  27  공주  데미스키라  178 NaN

In [167]:
df[(df['나이'] >30) & (df['나이'] < 50)]

      이름  나이     직업     국적    키         재산
1     토르  45      신  아스가르드  190        NaN
4     헐크  33  핵물리학자     미국  270 1000000000
6  블랙위도우  32    스파이    러시아  170   50000000

In [8]:
df.sort_values('키')

      이름  나이     직업     국적    키          재산
6  블랙위도우  32    스파이    러시아  170    50000000
5   캡틴마블  25    파일럿     미국  170   340000000
0   아이언맨  58    CEO     미국  174 11500000000
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
1     토르  45      신  아스가르드  190         NaN
4     헐크  33  핵물리학자     미국  270  1000000000

In [25]:
df2['전투력'] = [1,2,3,4,5,6]
df2['전투력'] += 50
df2

      이름  나이     직업     국적    키         재산  전투력
b     토르  45      신  아스가르드  190        NaN   51
c  스파이더맨  18   고등학생     미국  177        600   52
d   원더우먼  27     공주  데미스키라  178        NaN   53
f     헐크  33  핵물리학자     미국  270 1000000000   54
g   캡틴마블  25    파일럿     미국  170  340000000   55
h  블랙위도우  32    스파이    러시아  170   50000000   56

In [26]:
df3=df.copy()

In [30]:
df3.dropna()
df3.dropna(axis=1)

      이름  나이     직업     국적    키
0   아이언맨  58    CEO     미국  174
1     토르  45      신  아스가르드  190
2  스파이더맨  18   고등학생     미국  177
3   원더우먼  27     공주  데미스키라  178
4     헐크  33  핵물리학자     미국  270
5   캡틴마블  25    파일럿     미국  170
6  블랙위도우  32    스파이    러시아  170